Revit 2027 API
UIControlledApplication.TransferredProjectStandards Event
 Subscribe to the TransferredProjectStandards event to be notified after the scope of a Transfer Project Standards operation has been finalized.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public event EventHandler<TransferredProjectStandardsEventArgs> TransferredProjectStandards
Public Event TransferredProjectStandards As EventHandler(Of TransferredProjectStandardsEventArgs)
public:
 event EventHandler<TransferredProjectStandardsEventArgs^>^ TransferredProjectStandards {
	void add (EventHandler<TransferredProjectStandardsEventArgs^>^ value);
	void remove (EventHandler<TransferredProjectStandardsEventArgs^>^ value);
}
member TransferredProjectStandards : IEvent<EventHandler<TransferredProjectStandardsEventArgs>,
    TransferredProjectStandardsEventArgs>
Value
EventHandler<TransferredProjectStandardsEventArgs>
Remarks
This event is raised just after the native Revit items have been transferred, but before the transaction has been committed. An add-in that registered external items in TransferringProjectStandards should subscribe to this event to carry out the transfer of any items that it registered if the user enabled those items for transfer. During the scope of this event, modification is permitted to the target document and modification is not permitted to the source document.
See Also
Reference
UIControlledApplication Class
Autodesk.Revit.UI Namespace